app/controllers/tweets_controller.rb

  def index
    #@tweets = Tweet.all
    if params[:query].present?
      @tweets = Tweet.where(content: params[:query])
    else
      @tweets = Tweet.all
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."content" = ?  [["content", "t1"]]
SELECT "tweets".* FROM "tweets"

  def create
    @tweet = Tweet.new(tweet_params)

    respond_to do |format|
      if @tweet.save
---
INSERT INTO "tweets" ("content", "created_at", "updated_at", "title") VALUES (?, ?, ?, ?)  [["content", "conten"], ["created_at", "2018-08-19 20:32:03.176212"], ["updated_at", "2018-08-19 20:32:03.176212"], ["title", "nuwvo"]]